Repository: aliiibnepasha/AIItalianbraintrotGenerator_iOS
Catalog: BrainrotApp/Brainrot_Generator/Localization/*.lproj/Localizable.strings
Languages: it, ja, ko

# common.ok
source: OK
ko: 확인

# common.share
source: Share
it: Condividi
ja: 共有
ko: 공유

# common.delete
source: Delete
it: Elimina
ja: 削除
ko: 삭제

# common.favorite
source: Favorite
it: Preferito
ja: お気に入り
ko: 즐겨찾기

# common.favorited
source: Favorited
it: Nei preferiti
ja: お気に入り済み
ko: 즐겨찾기에 추가됨

# common.generate
source: Generate
it: Genera
ja: 生成
ko: 생성

# common.generate_again
source: Generate Again
it: Genera di nuovo
ja: 再生成
ko: 다시 생성

# common.language
source: Language
it: Lingua
ja: 言語
ko: 언어

# common.done
source: Done
it: Fine
ja: 完了
ko: 완료

# common.restore
source: Restore
it: Ripristina
ja: 復元
ko: 복원

# common.terms_of_use
source: Terms of Use
it: Termini d'uso
ja: 利用規約
ko: 이용 약관

# common.privacy_policy
source: Privacy Policy
it: Informativa sulla privacy
ja: プライバシーポリシー
ko: 개인정보 처리방침

# common.get_premium
source: Get Premium
it: Ottieni Premium
ja: プレミアムを取得
ko: 프리미엄 이용

# common.home
source: Home
ja: ホーム
ko: 홈

# common.setting
source: Setting
it: Impostazioni
ja: 設定
ko: 설정

# splash.title
source: ITALIAN BRAINROT
ja: イタリアン ブレインロット
ko: 이탈리안 브레인로트

# intro.next
source: Next
it: Avanti
ja: 次へ
ko: 다음

# intro1.title
source: Enter the World of Italian Brainrot!
it: Entra nel mondo di Italian Brainrot!
ja: イタリアン・ブレインロットの 世界へ飛び込もう！
ko: 이탈리안 브레인로트의 세계로 들어가요!

# intro2.title
source: Create your own rot!
it: Crea il tuo brainrot!
ja: 自分だけのブレインロットを作ろう！
ko: 나만의 로트를 만들어봐!

# intro3.title
source: Share,Break, Go Viral!
it: Condividi, distruggi, diventa virale!
ja: シェアして、ぶち壊して、バズらせよう！
ko: 공유하고, 터뜨리고, 바이럴!

# intro3.get_started
source: Get Started
it: Inizia
ja: 始める
ko: 시작하기

# home.header_title
source: Who will you be today?
it: Chi sarai oggi?
ja: 今日は 誰になる？
ko: 오늘 당신은 누가 될까요?

# home.placeholder
source: Enter your character name here
it: Inserisci qui il nome del personaggio
ja: ここにキャラクター名を入力
ko: 캐릭터 이름을 입력하세요

# home.last_generated
source: Last Generated
it: Ultima creazione
ja: 最新生成
ko: 최근 생성

# home.last_generated_empty
source: Generate your first character to see it here.
it: Crea il tuo primo personaggio per vederlo qui.
ja: ここに表示するには最初のキャラクターを生成してください。
ko: 여기에서 보려면 첫 캐릭터를 생성하세요.

# home.favorites
source: Favorites
it: Preferiti
ja: お気に入り
ko: 즐겨찾기

# home.favorites_empty
source: Tap the heart on a creation to add it to favorites.
it: Tocca il cuore su una creazione per aggiungerla ai preferiti.
ja: ハートをタップするとお気に入りに追加されます。
ko: 하트를 탭하면 즐겨찾기에 추가됩니다.

# home.alert.missing_keywords
source: Please enter a character name
it: Inserisci il nome del personaggio
ja: キャラクター名を入力してください
ko: 캐릭터 이름을 입력해주세요

# home.alert.generation_failed
source: Generation failed
it: Generazione non riuscita
ja: 生成に失敗しました
ko: 생성에 실패했습니다

# home.tab.home
source: Home
ja: ホーム
ko: 홈

# home.tab.settings
source: Setting
it: Impostazioni
ja: 設定
ko: 설정

# home.quota_label
source: Images
it: Immagini
ja: 画像
ko: 이미지

# home.quota_loading
source: Loading...
it: Caricamento...
ja: 読み込み中...
ko: 불러오는 중...

# generate.header_title
source: Customize Your Chaos
it: Personalizza il tuo caos
ja: カオスを カスタマイズ
ko: 혼돈을 연출해보세요

# generate.section.gender
source: Gender / Vibe
it: Genere / Mood
ja: 性別 / ムード
ko: 성별 / 분위기

# generate.section.mood
source: Mood Selector
it: Selettore mood
ja: ムードセレクター
ko: 무드 선택

# generate.section.accent
source: Accent Strength
it: Intensità accento
ja: アクセント強度
ko: 억양 강도

# generate.section.outfit
source: Outfit Style
it: Stile outfit
ja: 衣装スタイル
ko: 의상 스타일

# generate.section.aspect
source: Aspect Ratio
it: Formato
ja: アスペクト比
ko: 화면 비율

# generate.gender.male
source: Male
it: Maschile
ja: 男性
ko: 남성

# generate.gender.female
source: Female
it: Femminile
ja: 女性
ko: 여성

# generate.gender.mixed
source: Mixed
it: Misto
ja: ミックス
ko: 혼합

# generate.gender.chaos
source: Chaos
it: Caos
ja: カオス
ko: 카오스

# generate.mood.romantic
source: Romantic
it: Romantico
ja: ロマンチック
ko: 로맨틱

# generate.mood.mafia
source: Mafia Drama
it: Dramma mafioso
ja: マフィアドラマ
ko: 마피아 드라마

# generate.mood.cafe
source: Cafe Gossip
it: Gossip da bar
ja: カフェゴシップ
ko: 카페 가십

# generate.mood.tiktok
source: Tiktok-Rot
ja: TikTokロット
ko: 틱톡-로트

# generate.outfit.vintage
source: Vintage
ja: ヴィンテージ
ko: 빈티지

# generate.outfit.modern
source: Modern
it: Moderno
ja: モダン
ko: 모던

# generate.outfit.meme
source: Meme-Core
ja: ミームコア
ko: 밈-코어

# generate.slider.low
source: Mild
it: Leggero
ja: 控えめ
ko: 부드럽게

# generate.slider.high
source: Over-The Top
it: Esagerato
ja: ぶっ飛び
ko: 과장되게

# generate.default_title
source: Custom Brainrot Character
it: Personaggio Brainrot personalizzato
ja: カスタムブレインロットキャラクター
ko: 커스텀 브레인로트 캐릭터

# generate.default_character
source: an imaginative persona
it: una persona immaginaria
ja: 想像上のペルソナ
ko: 상상력 넘치는 페르소나

# generating.status
source: Generating...
it: Generazione in corso...
ja: 生成中...
ko: 생성 중...

# result.title
source: Ai Brainrot
ja: AI ブレインロット
ko: AI 브레인로트

# gallery.title
source: Gallery
it: Galleria
ja: ギャラリー
ko: 갤러리

# gallery.empty_title
source: Your creations will appear here
it: Le tue creazioni appariranno qui
ja: あなたの作品がここに表示されます
ko: 당신의 작품이 여기에 나타나요

# gallery.empty_subtitle
source: Generate an image to see it in your gallery.
it: Genera un'immagine per vederla nella galleria.
ja: ギャラリーに表示するには画像を生成してください。
ko: 갤러리에서 보려면 이미지를 생성하세요.

# settings.title
source: Setting
it: Impostazioni
ja: 設定
ko: 설정

# settings.language
source: Language
it: Lingua
ja: 言語
ko: 언어

# settings.terms_of_service
source: Terms Of Service
it: Termini del servizio
ja: 利用規約
ko: 서비스 약관

# settings.community_guidelines
source: Community Guidelines
it: Linee guida della community
ja: コミュニティガイドライン
ko: 커뮤니티 가이드라인

# settings.creations
source: Creations
it: Creazioni
ja: 作品
ko: 창작물

# language.title
source: Language
it: Lingua
ja: 言語
ko: 언어

# language.done
source: Done
it: Fine
ja: 完了
ko: 완료

# language.name.english
source: English
it: Inglese
ja: 英語
ko: 영어

# language.name.korean
source: Korean
it: Coreano
ja: 韓国語
ko: 한국어

# language.name.italian
source: Italian
it: Italiano
ja: イタリア語
ko: 이탈리아어

# language.name.japanese
source: Japanese
it: Giapponese
ja: 日本語
ko: 일본어

# paywall.hero_title
source: Unlock Brainrot Premium
it: Sblocca Brainrot Premium
ja: ブレインロット プレミアムを解放しよう
ko: 브레인로트 프리미엄을 잠금 해제하세요

# paywall.benefit.faster_results
source: Faster Results
it: Risultati più rapidi
ja: より速い結果
ko: 더 빠른 결과

# paywall.benefit.unlock_premium
source: Unlock premium features
it: Sblocca funzioni premium
ja: プレミアム機能を解放
ko: 프리미엄 기능 해제

# paywall.benefit.unlimited_memes
source: Unlimited Meme Generations
it: Generazioni di meme illimitate
ja: 無制限のミーム生成
ko: 무제한 밈 생성

# paywall.benefit.nonstop_chaos
source: Non-Stop Chaos At Your Fingertips
it: Caos senza sosta a portata di mano
ja: 指先で止まらないカオス
ko: 손끝에서 멈추지 않는 혼란

# paywall.free_trial
source: Not sure yet? Enable free trial
it: Non sei sicuro? Attiva la prova gratuita
ja: まだ迷ってる？無料トライアルをオン
ko: 아직 고민 중? 무료 체험을 켜세요

# paywall.plan.weekly
source: 1 Week, $9.99
it: 1 settimana, $9.99
ja: 1週間、$9.99
ko: 1주, $9.99

# paywall.plan.monthly
source: 1 Month, $19.99
it: 1 mese, $19.99
ja: 1か月、$19.99
ko: 1개월, $19.99

# paywall.plan.monthly_subtitle
source: Only $4.50 / week
it: Solo $4.50 a settimana
ja: 週あたりわずか$4.50
ko: $4.50 / 주당

# paywall.plan.badge
source: Best value
it: Miglior offerta
ja: 最もお得
ko: 최고의 혜택

# paywall.subscribe
source: Subscribe
it: Abbonati
ja: 購読する
ko: 구독하기

# paywall.legal
source: By continuing, you agree to Privacy Policy and Terms & Condition
it: Continuando accetti l'Informativa sulla privacy e i Termini e condizioni
ja: 続行するとプライバシーポリシーと 利用規約に同意したことになります。
ko: 계속하면 개인정보 처리방침과 이용 약관에 동의하게 됩니다.

# paywall.restore
source: Restore
it: Ripristina
ja: 復元
ko: 복원

# paywall.terms
source: Terms of Use
it: Termini d'uso
ja: 利用規約
ko: 이용 약관

# paywall.privacy
source: Privacy Policy
it: Informativa sulla privacy
ja: プライバシーポリシー
ko: 개인정보 처리방침

# service_error.unexpected_response
source: The image service returned an unexpected response.
it: Il servizio immagini ha restituito una risposta imprevista.
ja: 画像サービスが予期しない応答を返しました。
ko: 이미지 서비스가 예기치 않은 응답을 반환했습니다.

# service_error.status_with_message
source: Image service error (%1$@): %2$@
it: Errore del servizio immagini (%1$@): %2$@
ja: 画像サービスのエラー（%1$@）: %2$@
ko: 이미지 서비스 오류(%1$@): %2$@

# service_error.missing_url
source: No image URL was provided by the service.
it: Il servizio non ha fornito alcun URL dell'immagine.
ja: サービスから画像URLが提供されませんでした。
ko: 서비스에서 이미지 URL을 제공하지 않았습니다.

# service_error.invalid_image_data
source: The image data returned by the service was invalid.
it: I dati dell'immagine restituiti dal servizio non sono validi.
ja: サービスから返された画像データが無効です。
ko: 서비스가 반환한 이미지 데이터가 올바르지 않습니다.

# service_error.download_failed
source: Unable to download the generated image.
it: Impossibile scaricare l'immagine generata.
ja: 生成された画像をダウンロードできません。
ko: 생성된 이미지를 다운로드할 수 없습니다.

# service_error.unknown_error
source: Unknown error
it: Errore sconosciuto
ja: 不明なエラー
ko: 알 수 없는 오류

# service_error.no_response
source: No response body
it: Nessun contenuto nella risposta
ja: レスポンス本文がありません
ko: 응답 본문 없음
